Repository: openstack-archive/deb-heat
Catalog: debian/po/*.po
Languages: it

source: Authentication server hostname:
it: Nome host per il server di autenticazione:

source: Please specify the hostname of the authentication server. Typically this is also the hostname of the OpenStack Identity Service (Keystone).
it: Specificare il nome host del server di autenticazione. Tipicamente, è anche il nome host dell'OpenStack Identity Service (Keystone).

source: Authentication server tenant name:
it: Nome del locatario («tenant») per il server di autenticazione:

source: Please specify the authentication server tenant name.
it: Specificare il nome del locatario («tenant») per il server di autenticazione.

source: Authentication server username:
it: Nome utente per il server di autenticazione:

source: Please specify the username to use with the authentication server.
it: Specificare il nome utente da usare con il server di autenticazione.

source: Authentication server password:
it: Password per il server di autenticazione:

source: Please specify the password to use with the authentication server.
it: Specificare la password da usare con il server di autenticazione.

source: Register Heat in the Keystone endpoint catalog?
it: Registrare Heat nel catalogo di punti terminali Keystone?

source: Each OpenStack service (each API) should be registered in order to be accessible. This is done using "keystone service-create" and "keystone endpoint-create". This can be done automatically now.
it: Ogni servizio OpenStack (ogni API) dovrebbe essere registrato per poter essere accessibile. Questo viene fatto usando «keystone service-create» e «keystone endpoint-create». Ciò può essere fatto ora automaticamente.

source: Keystone server IP address:
it: Indirizzo IP del server Keystone:

source: Please enter the IP address of the Keystone server, so that heat-api can contact Keystone to do the Heat service and endpoint creation.
it: Inserire l'indirizzo IP del server Keystone, in modo che heat-api possa contattare Keystone per effettuare la creazione del servizio e del punto terminale Heat.

source: Heat endpoint IP address:
it: Indirizzo IP del punto terminale Heat:

source: Please enter the IP address that will be used to contact Heat.
it: Inserire l'indirizzo IP che verrà usato per contattare Heat.

source: This IP address should be accessible from the clients that will use this service, so if you are installing a public cloud, this should be a public IP address.
it: Questo indirizzo IP dovrebbe essere accessibile dai client che useranno il servizio, perciò se si sta installando una cloud pubblica, questo dovrebbe essere un indirizzo IP pubblico.

source: Name of the region to register:
it: Nome della regione da registrare:

source: OpenStack supports using availability zones, with each region representing a location. Please enter the zone that you wish to use when registering the endpoint.
it: OpenStack gestisce le zone di disponibilità, con ogni regione che rappresenta una posizione. Inserire la zona che si desidera usare durante la registrazione del punto terminale.

source: Set up a database for heat-common?
it: Impostare un database per heat-common?

source: No database has been set up for heat-common to use. Before continuing, you should make sure you have the following information:
it: Non è stato impostato alcun database per essere usato da heat-common. Prima di continuare assicurarsi di avere le seguenti informazioni:

source: * the type of database that you want to use; * the database server host name (that server must allow TCP connections from this machine); * a username and password to access the database.
it: * il tipo di database che si desidera usare; * il nome host del server di database (che deve permettere le connessioni TCP da questa macchina); * un nome utente e una password per accedere al database.

source: If some of these requirements are missing, do not choose this option and run with regular SQLite support.
it: Se non si ha uno o più di questi requisiti, non scegliere questa opzione ed eseguire con il regolare supporto per SQLite.

source: You can change this setting later on by running "dpkg-reconfigure -plow heat-common".
it: È possibile cambiare questa impostazione successivamente eseguendo «dpkg-reconfigure -plow heat-common».

source: IP address of your RabbitMQ host:
it: Indirizzo IP dell'host RabbitMQ:

source: In order to interoperate with other components of OpenStack, this package needs to connect to a central RabbitMQ server.
it: Per poter funzionare insieme agli altri componenti di OpenStack, questo pacchetto deve connettersi al server RabbitMQ centrale.

source: Please specify the IP address of that server.
it: Inserire l'indirizzo IP di tale server.

source: Username for connection to the RabbitMQ server:
it: Nome utente per la connessione al server RabbitMQ:

source: Please specify the username used to connect to the RabbitMQ server.
it: Specificare il nome utente da usare per connettersi al server RabbitMQ.

source: Password for connection to the RabbitMQ server:
it: Password per la connessione al server RabbitMQ:

source: Please specify the password used to connect to the RabbitMQ server.
it: Specificare la password da usare per connettersi al server RabbitMQ.
